In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1={'Names':['Aryan','Rishi','Abhi',np.nan,'Siri'],
       'Age':[np.nan,13,12,10,20],
        'City':['Hyd','Blr','Chn','Tpt',np.nan]}
dict1

{'Names': ['Aryan', 'Rishi', 'Abhi', nan, 'Siri'],
 'Age': [nan, 13, 12, 10, 20],
 'City': ['Hyd', 'Blr', 'Chn', 'Tpt', nan]}

In [4]:
d1=pd.DataFrame(dict1)

In [5]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [9]:
dict2={'Names':['Aryan','Rishi','Abhi','None','Siri'],
       'Age':[np.nan,13,12,10,20],
        'City':['Hyd','Blr','Chn','Tpt','None']}
d2=pd.DataFrame(dict2)

In [10]:
d2.dtypes

Names     object
Age      float64
City      object
dtype: object

In [11]:
d1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2  False  False  False
3   True  False  False
4  False  False   True

In [13]:
d1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [14]:
d1.isnull().sum()*100/len(d1)

Names    20.0
Age      20.0
City     20.0
dtype: float64

- np.nan : not a number this applicable for numerical columns only

- Generally data has some empty rows

- It is a data problem

- If you read that kind of data you will see Null

- You need to understand it is a data corrupted or ready a Null values are there

**Method-1**

**Fill with some random values**

**Method name**:fill na

In [15]:
d1.fillna(40)

   Names   Age City
0  Aryan  40.0  Hyd
1  Rishi  13.0  Blr
2   Abhi  12.0  Chn
3     40  10.0  Tpt
4   Siri  20.0   40

**Method-2**

- We can fill the output with w.r.t columns also

In [17]:
d1['Age']=d1['Age'].fillna(10)
d1

   Names   Age City
0  Aryan  10.0  Hyd
1  Rishi  13.0  Blr
2   Abhi  12.0  Chn
3    NaN  10.0  Tpt
4   Siri  20.0  NaN

In [18]:
d1['Age'].fillna(10)

# Here if we print d1 it will not get updated

# inplace=False

0    10.0
1    13.0
2    12.0
3    10.0
4    20.0
Name: Age, dtype: float64

In [19]:
d1['Age'].fillna(10,inplace=True)
d1

   Names   Age City
0  Aryan  10.0  Hyd
1  Rishi  13.0  Blr
2   Abhi  12.0  Chn
3    NaN  10.0  Tpt
4   Siri  20.0  NaN

In [22]:
d1['Names'].fillna('proya',inplace=True)

In [23]:
d1

   Names   Age City
0  Aryan  10.0  Hyd
1  Rishi  13.0  Blr
2   Abhi  12.0  Chn
3  proya  10.0  Tpt
4   Siri  20.0  NaN

In [24]:
dict1={'Names':['Aryan','Rishi','Abhi',np.nan,'Siri'],
       'Age':[np.nan,13,12,10,20],
        'City':['Hyd','Blr','Chn','Tpt',np.nan]}

d1=pd.DataFrame(dict1)

**Method-3**

- bfill

- ffill

- pad

- backfill

In [25]:
d1.fillna(method='bfill')

# It will fill with below value or next value
# Column1: Names index 4 is missing values it is filled with index 3 value
# Column2: Age index 1 is missing values it is filled with index 2 value
# Column3: City index 4 missing value it should be filled with next value but we dont have next value

   Names   Age City
0  Aryan  13.0  Hyd
1  Rishi  13.0  Blr
2   Abhi  12.0  Chn
3   Siri  10.0  Tpt
4   Siri  20.0  NaN

In [26]:
d1.fillna(method='ffill')

   Names   Age City
0  Aryan   NaN  Hyd
1  Rishi  13.0  Blr
2   Abhi  12.0  Chn
3   Abhi  10.0  Tpt
4   Siri  20.0  Tpt

In [27]:
d1.fillna(method='pad')

   Names   Age City
0  Aryan   NaN  Hyd
1  Rishi  13.0  Blr
2   Abhi  12.0  Chn
3   Abhi  10.0  Tpt
4   Siri  20.0  Tpt

In [29]:
d1.fillna(method='backfill',axis=1)

# axis 1 means columns
# so Nan values fill with next column values

   Names   Age City
0  Aryan   Hyd  Hyd
1  Rishi  13.0  Blr
2   Abhi  12.0  Chn
3   10.0  10.0  Tpt
4   Siri  20.0  NaN

In [30]:
d1.fillna(method='pad',axis=1)

   Names    Age  City
0  Aryan  Aryan   Hyd
1  Rishi   13.0   Blr
2   Abhi   12.0   Chn
3    NaN   10.0   Tpt
4   Siri   20.0  20.0

- backfill and bfill fill with next value

- pad and ffill fill with previous value

- but it will change based on axis

**Method-4**
- Mean
   
   - Numerical values can fill with mean value
   
   - but mean affect with outliers
   
   - if we dont have outliers it is best one
   
- Median

   - Numerical values can fill with median value
   
   - we know that median values does not  affect with outliers
   
   - so if outliers are there we can go with median
   
- Mode

    - Mode is used for categorical data

In [ ]:
dict1={'Names':['Aryan','Rishi','Abhi',np.nan,'Siri'],
       'Age':[np.nan,13,12,10,20],
        'City':['Hyd','Blr','Chn','Tpt',np.nan]}

d1=pd.DataFrame(dict1)

In [31]:
# we already know we can fill with some values based on specific columns using fillna
# d1.fillna(<random_number>)
# d1 represents all the columns

age_mean=d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    13.75
1    13.00
2    12.00
3    10.00
4    20.00
Name: Age, dtype: float64

In [32]:
age_median=d1['Age'].median()
d1['Age'].fillna(age_median)

0    12.5
1    13.0
2    12.0
3    10.0
4    20.0
Name: Age, dtype: float64

In [33]:
age_mode=d1['Age'].mode()
d1['Age'].fillna(age_mode)

0    10.0
1    13.0
2    12.0
3    10.0
4    20.0
Name: Age, dtype: float64

- Fill with rondom value

- Fill with random value on specific value

- Fill with methods

    - bfill
    
    -backfill
    
    -pad
    
    -ffill
    
- Fill with

    - Mean
    
    - Median
    
    - Mode

**Method-5**

**KNN imputer**

- KNN: K Nearest Neighbours
    
- K is a hyper parameter means user can choose

- It is distance metric:**Euclidian distance**

- KNN imputer will take the mean of the neighbour value

- The neighbour value can provided by using value=k

- It is under the sklearn package

- Under sklearn we have Imputer Method

- Under Imputer method we have KnnImputer

- Applicable only for numerical values

In [37]:
from sklearn.impute import KNNImputer

In [38]:
KI=KNNImputer()

In [40]:
KI.fit_transform(d1[['Age']])

array([[13.75],
       [13.  ],
       [12.  ],
       [10.  ],
       [20.  ]])